TaLucGiaHoang/AQUBIO_Android_STM32/STM32/Source/va-x/va-x/drv/drvflx/drvflx.c
/*
 * VA-X 外部フラッシュドライバ
 *
 * Copyright (C) 2018 Bionics co.,ltd.
 *
 * 変更:
 * - 2018/02/07 Takuya Goto <goto-takuya@bionics-k.co.jp>: 新規作成
 */

#include "drvflx.h"

#include <string.h>

#include <kernel.h>
#include <sil.h>
#include <t_syslog.h>
#include <t_stdlib.h>

#include "stm32f7xx.h"
#include "kernel_cfg.h"

#include "drvcmn.h"
#include "drvcmn_gpio.h"
#include "drvcmn_dma.h"

/*
 * マクロ定義
 */

// デバッグログ
#if 1
#define DBGLOG0(msg)					syslog(LOG_NOTICE, "[DRVFLX]" msg)
#define DBGLOG1(msg, arg1)				syslog(LOG_NOTICE, "[DRVFLX]" msg, arg1)
#define DBGLOG2(msg, arg1, arg2)		syslog(LOG_NOTICE, "[DRVFLX]" msg, arg1, arg2)
#define DBGLOG3(msg, arg1, arg2, arg3)	syslog(LOG_NOTICE, "[DRVFLX]" msg, arg1, arg2, arg3)
#else
#define DBGLOG0(msg)
#define DBGLOG1(msg, arg1)
#define DBGLOG2(msg, arg1, arg2)
#define DBGLOG3(msg, arg1, arg2, arg3)
#endif

// サービスコールのエラーのログ出力
static inline void svc_perror(const char *file, int_t line, const char *expr, ER ercd)
{
	if (ercd < 0) {
		t_perror(LOG_ERROR, file, line, expr, ercd);
	}
}
#define	SVC_PERROR(expr)	svc_perror(__FILE__, __LINE__, #expr, (expr))

// STM32 QUADSPI レジスタ設定値
#define FMODE_INDIRECT_WRITE 		0x0
#define FMODE_INDIRECT_READ 		0x1
#define FMODE_AUTOMATIC_POLLING 	0x2

#define DMODE_NO_DATA 				0x0
#define DMODE_SINGLE_LINE 			0x1
#define DMODE_TWO_LINES 			0x2
#define DMODE_FOUR_LINES 			0x3

#define ABSIZE_8BIT 				0x0
#define ABSIZE_16BIT 				0x1
#define ABSIZE_24BIT 				0x2
#define ABSIZE_32BIT 				0x3

#define ABMODE_NO_ALTERNATE_BYTES 	0x0
#define ABMODE_SINGLE_LINE 			0x1
#define ABMODE_TWO_LINES 			0x2
#define ABMODE_FOUR_LINES 			0x3

#define ADSIZE_8BIT 				0x0
#define ADSIZE_16BIT 				0x1
#define ADSIZE_24BIT 				0x2
#define ADSIZE_32BIT 				0x3

#define ADMODE_NO_ADDRESS 			0x0
#define ADMODE_SINGLE_LINE 			0x1
#define ADMODE_TWO_LINES 			0x2
#define ADMODE_FOUR_LINES 			0x3

#define IMODE_NO_INSTRUCTION 		0x0
#define IMODE_SINGLE_LINE 			0x1
#define IMODE_TWO_LINES 			0x2
#define IMODE_FOUR_LINES 			0x3

// フラッシュサイズ
#define FLASH_SIZE	(2 * 1024 * 1024)

// フラッシュページサイズ(書込みの単位)
#define FLASH_PAGE_SIZE	256

// フラッシュセクタサイズ(消去の単位)
#define FLASH_SECTOR_SIZE	(1024 * 4)	// 4kB

/*
 * 型定義
 */

// メッセージ送信用メモリブロック
typedef struct {
    uint32_t msg;
    intptr_t src;
    intptr_t dest;
    size_t size;
    DRVFLX_CALLBACK_T callback;
} DRVFLX_MPFBLK_T;

// DRVBLE_MPFBLK_SIZE は sizeof(DRVBLE_MPFBKL) に一致させること
static_assert(sizeof(DRVFLX_MPFBLK_T) == DRVFLX_MPFBLK_SIZE, "MPF size");

// STM32 QUADSPI関連
typedef struct {
    uint8_t fmode;
    uint8_t dmode;
    uint8_t dcyc;
    uint8_t absize;
    uint8_t abmode;
    uint8_t adsize;
    uint8_t admode;
    uint8_t imode;
    uint8_t instruction;
} QSPI_CCR_T;

typedef struct {
    uint8_t fmode;
    uint8_t dmode;
    uint8_t dcyc;
    uint8_t absize;
    uint8_t abmode;
    uint8_t adsize;
    uint8_t admode;
    uint8_t imode;
    uint8_t instruction;
} QSPI_TRANSFER_CONFIG_T;

typedef struct {
    uint32_t ar;
    uint32_t abr;
    void* mcuaddr;
    size_t length;
} QSPI_TRANSFER_DATA_T;


/*
 * 内部関数プロトタイプ
 */
// QUADSPI初期化
static void qspi_initialize();

// メッセージ送信
static void mpf_send(int msg, intptr_t src, intptr_t dest, size_t size, DRVFLX_CALLBACK_T callback);

// フラッシュ設定
static void qspi_flash_configure();

// QSPI転送
static int qspi_transfer(const QSPI_TRANSFER_CONFIG_T* config, const QSPI_TRANSFER_DATA_T* data);

// DMA ISRコールバック
static void dma_isr_callback();

// フラッシュのステータス待ち
static void qspi_wait_flash_status(uint32_t mask, uint32_t match);

// SPIフラッシュ読み込み
static int qspi_flash_read(void* dest, intptr_t flash_addr, size_t length);

// SPIフラッシュ書込み
static int qspi_flash_write(const void* src, intptr_t flash_addr, size_t length);

// SPIフラッシュ消去
static int qspi_flash_erase(intptr_t flash_addr, size_t length);

/*
 * 定数定義
 */

// GPIO設定(QSPI, CE以外)
static const DRVCMN_GPIO_SETTING_T GPIO_SETTING_QSPI = {
    .mode = DRVCMN_GPIO_MODE_AF,
    .otype = DRVCMN_GPIO_OTYPE_PP,
    .ospeed = DRVCMN_GPIO_OSPEED_VERYHIGH,
    .pupd = DRVCMN_GPIO_PUPD_NONE,
    .afno = 9,
};

// GPIO設定(QSPI, CE)
static const DRVCMN_GPIO_SETTING_T GPIO_SETTING_QSPI_CE = {
    .mode = DRVCMN_GPIO_MODE_AF,
    .otype = DRVCMN_GPIO_OTYPE_PP,
    .ospeed = DRVCMN_GPIO_OSPEED_VERYHIGH,
    .pupd = DRVCMN_GPIO_PUPD_PULLUP,
    .afno = 10,
};

// GPIOピン設定(QSPI)
static const struct {
    DRVCMN_GPIO_PIN_T pin;
    const DRVCMN_GPIO_SETTING_T* setting;
} GPIO_PINS_QSPI[] = {
    { { DRVCMN_GPIO_PORT_A,	1	},	&GPIO_SETTING_QSPI		},	// QUADSPI_BK1_IO3(AF9)
    { { DRVCMN_GPIO_PORT_B,	2	},	&GPIO_SETTING_QSPI		},	// QUADSPI_CLK(AF9)
    { { DRVCMN_GPIO_PORT_B,	6	},	&GPIO_SETTING_QSPI_CE	},	// QUADSPI_BK1_NCS(AF10)
    { { DRVCMN_GPIO_PORT_C,	10	},	&GPIO_SETTING_QSPI		},	// QUADSPI_BK1_IO1(AF9)
    { { DRVCMN_GPIO_PORT_D,	11	},	&GPIO_SETTING_QSPI		},	// QUADSPI_BK1_IO0(AF9)
    { { DRVCMN_GPIO_PORT_E,	2	},	&GPIO_SETTING_QSPI		},	// QUADSPI_BK1_IO2(AF9)
};

// DMAストリーム
static const DRVCMN_DMA_STR_T DMA_STREAM = {2,	2};	// DMA2 Stream2

// DMAストリーム設定
static const DRVCMN_DMA_SETTING_T DMA_SETTING = {
    .chsel = 11,							// Channel selection
    .dbm = false,							// Double buffer mode
    .pl = DRVCMN_DMA_PL_VERY_HIGH,			// Priority level
    .data_size = DRVCMN_DMA_DATASIZE_8BIT,	// Memory/Peripheral data size
    .minc = true,							// Memory increment mode
    .pinc = false,							// Peripheral increment mode
    .dir = DRVCMN_DMA_DIR_P2M,				// Data transfer direction
};

// ステータスレジスタマスク: Write operation status(BUSY)
static const uint32_t FLASH_STATUS_MASK_BUSY = (0x1 << 7) | (0x1 << 0);	// [7,0]BUSY

// ステータスレジスタマスク: Write-Enable Latch status(WEL)
static const uint32_t FLASH_STATUS_MASK_WEL = (0x1 << 1);	// [1]WEL


// フラッシュコマンド
// Reset Enable
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_RSTEN = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x66,
};

