TaLucGiaHoang/AQUBIO_Android_STM32/STM32/Source/va-x/va-x/drv/drvflx/drvflx.c
// Reset
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_RST = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x99,
};

// Write Enable
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_WREN = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x06,
};

// Write Status Register
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_WRSR = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_SINGLE_LINE,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x01,
};

// Global Block-Protection Unlock
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_ULBPR = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x98,
};

// Sector Erase
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_SE = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_SINGLE_LINE,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x20,
};

// Chip Erase
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_CE = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0xc7,
};

// SPI Quad IO Read
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_SQOR = {
    .fmode = FMODE_INDIRECT_READ,
    .dmode = DMODE_FOUR_LINES,
    .dcyc = 8,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_SINGLE_LINE,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x6b,
};

// SPI Quad Page Program
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_QPP = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_FOUR_LINES,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_FOUR_LINES,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x32,
};

// メッセージ番号
enum {
  MSG_NONE = 0,
  MSG_INITIALIZE,
  MSG_READ,
  MSG_WRITE,
  MSG_ERASE,
  MSG_START_MEMMAP,
  MSG_END_MEMMAP,
};

// データキュータイムアウト
static const int32_t DTQTIMEOUT = 1000;

// イベントフラグ
static const FLGPTN FLGPTN_DMA_COMPLETE = 			(0x1 << 0);
static const FLGPTN FLGPTN_QSPI_TRANSFER_COMPLETE = (0x1 << 1);
static const FLGPTN FLGPTN_QSPI_STATUS_MATCH = 		(0x1 << 2);

/*
 * 内部変数
 */
//static uint8_t s_testbuf[1024*4];// 4k

/*********************************************************************
 * 公開関数
 ********************************************************************/

/*
 * ペリフェラル初期化
 */
void drvflx_initialize_peripherals()
{
    DBGLOG0("drvflx_initialize_peripherals");

    // GPIOピン設定
    for (int i = 0; i < sizeof(GPIO_PINS_QSPI) / sizeof(GPIO_PINS_QSPI[0]); i++) {
        drvcmn_gpio_pin_initialize(&(GPIO_PINS_QSPI[i].pin), GPIO_PINS_QSPI[i].setting);
    }

    // DMA初期化
    drvcmn_dma_initialize(&DMA_STREAM, &DMA_SETTING);

    // QUADSPI初期化
    qspi_initialize();

}

/*
 * ドライバ初期化
 */
void drvflx_initialize(DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvflx_initialize");

    // タスク起動
    ER er = 0;

    er = act_tsk(TSK_DRVFLX);
    assert(er == E_OK);

    mpf_send(MSG_INITIALIZE, (intptr_t)NULL, (intptr_t)NULL, 0, callback);
}

/*
 * 読み込み
 */
void drvflx_read(void* dest, intptr_t src, size_t length, DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvflx_read");

    mpf_send(MSG_READ, (intptr_t)src, (intptr_t)dest, length, callback);
}

/*
 * メモリマップ開始
 */
void drvflx_start_memmap(DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvflx_memmap");

    mpf_send(MSG_START_MEMMAP, 0, 0, 0, callback);
}

/*
 * メモリマップ終了
 */
void drvflx_end_memmap(DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvflx_end_memmap");

    mpf_send(MSG_END_MEMMAP, 0, 0, 0, callback);
}

/*
 * 書き込み
 */
void drvflx_write(intptr_t dest, const void* src, size_t length, DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvflx_write");

    mpf_send(MSG_WRITE, (intptr_t)src, (intptr_t)dest, length, callback);
}

/*
 * 消去
 */
void drvflx_erase(intptr_t addr, size_t length, DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvflx_erase");

    mpf_send(MSG_ERASE, 0, (intptr_t)addr, length, callback);
}


/*
 * タスク
 */
void drvflx_task(intptr_t exinf)
{
    DBGLOG0("drvlfx_task() starts.");

    while (true) {
        DRVFLX_MPFBLK_T* blk = NULL;
        ER er = 0;
        er = trcv_dtq(DTQ_DRVFLX, (intptr_t*)&blk, TMO_FEVR);
        assert(er == E_OK);
        assert(blk);
        switch (blk->msg) {
        case MSG_INITIALIZE: {
            assert(blk->callback);
            //DBGLOG0("MSG_INITIALIZE");

            qspi_flash_configure();
            blk->callback(DRVFLX_EVT_INITIALIZE_COMPLETE, 0, 0);
            break;
        }
        case MSG_READ:
            //DBGLOG0("MSG_READ");

            qspi_flash_read((void*)blk->dest, blk->src, blk->size);
            blk->callback(DRVFLX_EVT_READ_COMPLETE, 0, 0);
            break;
        case MSG_START_MEMMAP:
            //DBGLOG0("MSG_START_MEMMAP");

            blk->callback(DRVFLX_EVT_MEMMAP_STARTED, 0, 0);
            break;
        case MSG_END_MEMMAP:
            //DBGLOG0("MSG_END_MEMMAP");

            blk->callback(DRVFLX_EVT_MEMMAP_END, 0, 0);
            break;
        case MSG_WRITE:
            //DBGLOG0("MSG_WRITE");
            qspi_flash_write((void*)blk->src, blk->dest, blk->size);
            blk->callback(DRVFLX_EVT_WRITE_COMPLETE, 0, 0);
            break;
        case MSG_ERASE:
            //DBGLOG0("MSG_ERASE");

