TaLucGiaHoang/AQUBIO_Android_STM32/STM32/Source/va-x/va-x/drv/drvflx/drvflx.c
    return 0;
}

/*
 * SPIフラッシュ消去
 */
int qspi_flash_erase(intptr_t flash_addr, size_t length)
{
    assert(flash_addr % FLASH_SECTOR_SIZE == 0);
    assert(length > 0 && length % FLASH_SECTOR_SIZE == 0);

    intptr_t cur_flash = flash_addr;

    while (cur_flash < flash_addr + length) {
        // 消去実行
        qspi_transfer(&FLASH_CMD_WREN, NULL);	// Write Enable
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY | FLASH_STATUS_MASK_WEL, FLASH_STATUS_MASK_WEL);
        qspi_transfer(&FLASH_CMD_SE, &(QSPI_TRANSFER_DATA_T){.ar = cur_flash});
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

        cur_flash += FLASH_SECTOR_SIZE;
    }

    return 0;
}

/*
 * QSPIの転送開始
 */
int qspi_transfer(const QSPI_TRANSFER_CONFIG_T* config, const QSPI_TRANSFER_DATA_T* data)
{
    assert(config);

    ER er = E_OK;
    FLGPTN flgptn = 0;
    int spi_error = 0;

    assert(drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 5, 0x1) == 0);

    // データ転送がある場合
    if (config->dmode != DMODE_NO_DATA) {
        // QUADSPI_DLR
        assert(data);
        assert(data->length > 0);
        drvcmn_setreg32(QSPI_R_BASE + 0x10 /* QUADSPI_DLR */, 0, ~(uint32_t)0, data->length - 1);	// QUADSPI_DLR
    }

    // ステータスレジスタクリア
    drvcmn_setreg32(QSPI_R_BASE + 0x0C /* QUADSPI_FCR */, 0, (0x1 << 1) | (0x1 << 0), ~(uint32_t)0);	// CTCF,CTEF

    // イベントフラグクリア
    er = clr_flg(FLG_DRVFLX, ~FLGPTN_QSPI_TRANSFER_COMPLETE);
    assert(er == E_OK);

    // 割込み有効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 16) | (0x1 << 17), ~(uint32_t)0);	// TCIE, TEIE

    // QUADSPI_CCR
    uint32_t ccr_val = 0;
    ccr_val = drvcmn_getreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t)0);	// QUADSPI_CCR
    drvcmn_setreg32((intptr_t)&ccr_val, 26, 0x3, config->fmode);		// FMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 24, 0x3, config->dmode);		// DMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 18, 0x1f, config->dcyc);		// DCYC
    drvcmn_setreg32((intptr_t)&ccr_val, 16, 0x3, config->absize);		// ABSIZE
    drvcmn_setreg32((intptr_t)&ccr_val, 14, 0x3, config->abmode);		// ABMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 12, 0x3, config->adsize);		// ADSIZE
    drvcmn_setreg32((intptr_t)&ccr_val, 10, 0x3, config->admode);		// ADMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 8, 0x3, config->imode);			// IMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 0, 0xff, config->instruction);	// INSTRUCTION
    drvcmn_setreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t)0, ccr_val);	// set

    // アドレスがある場合
    if (config->admode != ADMODE_NO_ADDRESS) {
        assert(data);
        assert(data->ar < FLASH_SIZE);
        drvcmn_setreg32(QSPI_R_BASE + 0x18 /* QUADSPI_AR */, 0, ~(uint32_t)0, data->ar);
    }

    // Alternate bytes がある場合
    if (config->abmode != ABMODE_NO_ALTERNATE_BYTES) {
        assert(data);
        drvcmn_setreg32(QSPI_R_BASE + 0x1C /* QUADSPI_ABR */, 0, ~(uint32_t)0, data->abr);
    }

    // データ転送がある場合
    if (config->dmode != DMODE_NO_DATA) {
        assert(data);
        assert(data->length > 0);

        // フラグクリア
        er = clr_flg(FLG_DRVFLX, ~FLGPTN_DMA_COMPLETE);
        assert(er == E_OK);

        // DMA設定
        DRVCMN_DMA_XFER_SETTING_T dmas_setting = {0};
        if (config->fmode == FMODE_INDIRECT_READ) {
            dmas_setting.dir = DRVCMN_DMA_DIR_P2M;
            dmas_setting.src = QSPI_R_BASE + 0x20;
            dmas_setting.dest = (uintptr_t)data->mcuaddr;
            dmas_setting.use_fifo = true;
        } else if (config->fmode == FMODE_INDIRECT_WRITE) {
            dmas_setting.dir = DRVCMN_DMA_DIR_M2P;
            dmas_setting.src = (uintptr_t)data->mcuaddr;
            dmas_setting.dest = QSPI_R_BASE + 0x20;
            dmas_setting.use_fifo = true;
        } else {
            assert(false);
        }
        dmas_setting.nbytes = data->length;
        dmas_setting.nxfer = 1;
        dmas_setting.isr = dma_isr_callback;

        // DMAストリーム有効
        drvcmn_dma_transfer_enable(&DMA_STREAM, &dmas_setting);

        // QSPI DMA有効
        drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 2, 0x1, 1);	// DMAEN => 1

        // QSPI & DMA 転送完了待ち
        er = twai_flg(FLG_DRVFLX, FLGPTN_QSPI_TRANSFER_COMPLETE | FLGPTN_DMA_COMPLETE, TWF_ANDW, &flgptn, 3000);
        assert(er == E_OK);
    } else {	// データ転送が無い場合
        // TCフラグ待ち
        er = twai_flg(FLG_DRVFLX, FLGPTN_QSPI_TRANSFER_COMPLETE, TWF_ANDW, &flgptn, 3000);
        assert(er == E_OK);
    }

    // 割込み無効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 16) | (0x1 << 17), 0);	// TCIE, TEIE
    // DMAストリーム無効
    drvcmn_dma_transfer_disable(&DMA_STREAM);
    // QSPI DMA無効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 2, 0x1, 0);	// DMAEN => 0

    return 0;
}

// DMAコールバック
void dma_isr_callback()
{
    //DBGLOG0("drvcam_dma_isr_callback");

    ER er = iset_flg(FLG_DRVFLX, FLGPTN_DMA_COMPLETE);
    assert(er == E_OK);
}


// フラッシュのステータスポーリング
void qspi_wait_flash_status(uint32_t mask, uint32_t match)
{
    ER er = E_OK;

    // ステータスマスク
    drvcmn_setreg32(QSPI_R_BASE + 0x24 /* QUADSPI_PSMKR */, 0, ~(uint32_t)0, mask);

    // ステータスマッチ
    drvcmn_setreg32(QSPI_R_BASE + 0x28 /* QUADSPI_PSMAR */, 0, ~(uint32_t)0, match);

    // ポーリングインターバル
    drvcmn_setreg32(QSPI_R_BASE + 0x2C /* QUADSPI_PIR */, 0, 0xffff, 0x10);
    
    // ステータスマッチフラグクリア
    drvcmn_setreg32(QSPI_R_BASE + 0x0C /* QUADSPI_FCR */, 0, (0x1 << 3), ~(uint32_t)0);	// CSMF

    // イベントフラグクリア
    er = clr_flg(FLG_DRVFLX, ~FLGPTN_QSPI_STATUS_MATCH);
    assert(er == E_OK);

    // ステータスマッチ割込み有効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 19), ~(uint32_t)0);	// SMIE

    drvcmn_setreg32(QSPI_R_BASE + 0x10 /* QUADSPI_DLR */, 0, ~(uint32_t)0, 0);	// QUADSPI_DLR
    uint32_t ccr_val = drvcmn_getreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t)0);	// QUADSPI_CCR
    drvcmn_setreg32((intptr_t)&ccr_val, 26, 0x3, FMODE_AUTOMATIC_POLLING);		// FMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 24, 0x3, DMODE_SINGLE_LINE);			// DMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 18, 0x1f, 0);							// DCYC
    drvcmn_setreg32((intptr_t)&ccr_val, 16, 0x3, ABSIZE_8BIT);					// ABSIZE
    drvcmn_setreg32((intptr_t)&ccr_val, 14, 0x3, ABMODE_NO_ALTERNATE_BYTES);	// ABMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 12, 0x3, ADSIZE_8BIT);					// ADSIZE
    drvcmn_setreg32((intptr_t)&ccr_val, 10, 0x3, ADMODE_NO_ADDRESS);			// ADMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 8, 0x3, IMODE_SINGLE_LINE);				// IMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 0, 0xff, 0x05);							// INSTRUCTION => 0x05(Read Status Register)
    drvcmn_setreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t)0, ccr_val);	// set

    // ステータスマッチ割込み待ち
    FLGPTN flgptn = 0;
    er = twai_flg(FLG_DRVFLX, FLGPTN_QSPI_STATUS_MATCH, TWF_ANDW, &flgptn, 5000);
    assert(er == E_OK);

    // ステータスマッチ割込み無効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 19), 0);	// SMIE

    return;
}

